Revit 2026 API

# CurtainSystemAddCurtainGrid Method

---

Add CurtainGrid on the specified face for the CurtainSystem.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void AddCurtainGrid(
	Reference face
)
```
```vb
Public Sub AddCurtainGrid (
	face As Reference
)
```
```cpp
public:
void AddCurtainGrid(
	Reference^ face
)
```
```fsharp
member AddCurtainGrid :
        face : Reference -> unit
```

#### Parameters

face Reference
    The face new CurtainGrid will be created on.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when the input argument face is . |
| InvalidOperationException | Thrown when creating CurtainGrid on the specified face fails or regenerate fails. |

#### Reference

CurtainSystem Class

Autodesk.Revit.DB Namespace